{"FaettterP":[{"\u003d\u003d\u003d\u003d\u003d\u003d WELCOME TO \u003d\u003d\u003d\u003d\u003d\u003d \u003d\u003d\u003d\u003d\u003d DIVINE JOURNEY \u003d\u003d\u003d\u003d\u003d A modpack by Atricos":false},{"\"An Adventure and a Challenge in one\" - would be the best way to describe the Divine Journey modpack. Modpacks like FTB Infinity Evolved Skyblock and Project Ozone 2 inspired me to create it, which are also modpacks that include modified recipes through MineTweaker.":false},{"":false},{"":false},{"":false},{"Divine Journey, as well as the ones listed before, have a direct line of progression through all installed mods, and at the end, have a way of crafting otherwise uncraftable items - Divine Journey makes almost all Creative Items available for crafting. To achieve this, it will be even more difficult than normally, because recipes are expensive and hugely rely on other mods.":false},{"":false},{"":false},{"The goal of the modpack can be explained in a couple words:":false},{"\"Make Infinite Infinity Ingots.\"":false},{"- achieved by first making one, and putting it into a Creative Strongbox.":false},{"":false},{"":false},{"":false},{"Divine Journey, the name, came from DivineRPG, one of the included mods. In order to accomplish your goals, you will need to travel through all of DivineRPG, as well as some other exploration oriented mods and dimensions, like Runic Dungeons, Twilight Forest, the Deep Dark, the Eldritch Dimension, the Dream World, Torment\u0027s Maze, and RFTools Worlds.":false},{"":false},{"And this book will be your guide through the journey. If you\u0027re unsure about a specific mod, or don\u0027t know how to progress, look up the point you\u0027re at in this book by the achievement section to find out what the next step is.":false},{"This pack currently features 2 modes, easy and hard (default is hard). To switch between the modes, use":false},{"\"/ftb_mode set easy\" or \"/ftb_mode set hard\".":false},{"":false},{"You will need to automate almost everything to be able to progress further, and you\u0027ve been given the tools to do so.":false},{"You can gather resources using VeinMiner, AgriCraft, MagicalCrops, the Builder, the Ender Quarry, and RFTools Dimensions.":false},{"You can Autocraft and Autoprocess with Applied Energistics 2 and automate everything with Thermal Expansion, EnderIO, MineFactory Reloaded, Botania, RFTools, Extra Utilities, and so on.":false},{"It\u0027s possible to simply progress through the modpack by just looking at Creative recipes and the Infinity Ingot recipe in NEI, and check the progression to get there.":false},{"Under certain items in NEI, I included Tooltips, especially by DivineRPG items that drop from bosses or are required to progress through the dimensions.":false},{"This book contains information about your progression, in the form of a quick summary (next 2 pages), and in the form of checkable achievements (rest of the book). If you ever lose this book, it is craftable, using a book and two purple dyes.":false},{"":false},{"\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d Summary about the":false},{"1. Tinker\u0027s Construct           2. Thermal Expansion          3. Ender IO                      4. QuantumFlux, MineFactory     Reloaded, Runic Dungeons,     Big Reactors, Simply            Jetpacks                        5. Iceika Dimension               6. Blood Magic (Early)          7. Applied Energistics 2        8. Eden Dimension              9. Botania (Early)              10. Magical Crops (Early)    11. Wildwood Dimension       12. Blood Magic (Late)      13. Twilight Forest               14. Botania (Late)":false},{"":false},{"line of progression \u003d\u003d\u003d\u003d\u003d\u003d\u003d":false},{"15. Apalachia Dimension     16. Thaumcraft (Early)     17. The Deep Dark            18. Skythern Dimension       19. Thaumcraft (Late)        20. Thaumic Energistics      21. Magical Crops (Late)     22. The End Dimension       23. Thaumic Tinkerer         24. Mortum Dimension          25. Witchery (Early)         26. Dungeon of Arcana     27. Witchery (Late)           28. Vethea Dimension,                 Draconic Evolution      29. RFTools Dimensions      30. Creative Items":false},{"\u003d Line of progression with \u003d \u003d checkable achievements \u003d":false},{"If you\u0027d like, you can check the box next to each point, to indicate you\u0027ve accomplished something. It\u0027s not obligatory, but you have the option to do so. ;)":false},{"1. Punch wood.":true},{"2. Craft basic Stone Tools.":true},{"3. Go on your first mining adventure.":true},{"4. Setup a simple base. (Look around first to be able to avoid Tainted Land.)":true},{"5. Craft a Furnace and smelt some Iron Ore for an Iron Pickaxe.":true},{"6. Veinmine Gravel, Sand \u0026 Clay to craft Grout. Smelt Grout to make Seared Bricks.":true},{"7. Setup a Tinkers\u0027 Construct Smeltery.":false},{"8. Collect Lava for your Smeltery.":false},{"9. Setup the 5 basic Tinkers\u0027 Tool Creation tables.":false},{"10. Make a Liquid Transfer Node and import Lava \u0026 Water into your smeltery to create Obsidian.":false},{"11. Make Alumite in your smeltery, and use it to craft Alumite Tools.":false},{"12. Mine Titanium, Obsidian, Rupee, Arlemite \u0026 Realmite Ore.":false},{"13. Make some power generating machine (like an Ender IO Stirling Generator), a Pulverizer and a Redstone Furnace.":false},{"14. Make an Induction Smelter, Magma Crucible \u0026 Fluid Transposer.":false},{"15. Make an Alloy Smelter \u0026 SAG Mill.":false},{"16. Setup a basic 3x3x3 Big Reactor to power your machines.":false},{"17. Create basic vanilla farms.":false},{"18. Make better Tinker\u0027s Construct weapons (maybe consider Beheadding) and a Bow or Crossbow.":false},{"19. Make a Jetpack or a Hang Glider to have some way of early game flight.":false},{"20. Build a Nether Portal, find a Nether Fortress, and grab some Blaze Rods \u0026 Wither Skeleton Heads. Watch out for DivineRPG mobs, you probably want to avoid them for now.":false},{"21. Build a simple automatic Cobblestone Generator. You can use a Transfer Node with a World Interaction upgrade or Cobblestone Frameworks.":false},{"22. Use Crafters or Compacting Drawers to compress your Cobblestone.":false},{"23. Use your Cobblestone to automatically create Seared Bricks in your Smeltery. Automatically extract the Seared Bricks with a redstone clock. You can even setup a separate Smeltery for this.":false},{"24. Explore your surroundings, find a Desert Pyramid, a Jungle Temple, or a Blacksmith Chest to get some Magical Chalk.":false},{"25. Make even better gear, and setup a Runic Dungeons Portal. Raid the dimension.":false},{"26. Craft a better jetpack or a JetPlate.":false},{"27. Brew some potions and kill the Wither (either in a Runic Dungeons room where it can spawn, or naturally).":false},{"28. Activate your Division Sigil from the Wither, and collect some Cursed Earth with a Silk Touch shovel.":false},{"29. Craft a Healing Axe (great for Blood Magic), and maybe some other Unstable Ingot Tools (like a Builder\u0027s Wand).":false},{"30. Make a mob farm using Cursed Earth, that automatically collects and stores drops.":false},{"31. Create a Portal to Iceika. Use Snow Blocks in a Nether Portal shape, and light the Portal with a Snow Globe. Once there, kill mobs to get Ice Shards and mine lots of Frozen Stone for Blood Magic.":false},{"32. Make a Blood Altar and a Sacrificial Orb.":false},{"33. Make Blood Runes to upgrade your Blood Altar to Tier 2.":false},{"33. Craft an Inscriber and automatically import \u0026 extract items from it to craft different processors.":false},{"34. Make an Item Fabricator and use it to craft components for an ME Drive.":false},{"35. Make an Energy Acceptor and an ME Terminal to setup a simple ME System. Store your items in it.":false},{"36. Make Crystal Growth Accelerators for Pure Certus Quartz and make and a Crafting Terminal.":false},{"37. Upgrade your Big Reactor to have more fuel rods, some kind of a coolant, automate Yellorium importing and Cyanite exporting.":false},{"38. Craft a Slice\u0027n\u0027Splice and a Soul Binder.":false},{"40. Craft Capacitor Banks and a Power Monitor in order to not waste power from your Big Reactor.":false},{"41. Setup automated crop farms using Ender IO Farming Stations or MineFactory Reloaded Planters and Harvesters.":false},{"42. Make Self-Sacrifice Runes; or make Sacrifice Runes and lead mobs from your mob farm to your Blood Altar to gain more Life Essence.":false},{"43. Make an RFTools Builder and a Shape Card (Quarry). Outline an area (you can right click on the edges with the Shape Card) and start quarrying. Use the Yellorium you get to generate more power.":false},{"44. Craft more ME Storage Cells and automatically import items from your Quarry into your ME System.":false},{"45. Make an Ender Chest and link an Ender Pouch to it. Connect your Ender Chest to your ME System through an Import Bus, so you can dump items into your Storage Cells from anywhere.":false},{"46. Setup more Drives and connect Deep Storage Units to your ME System with Storage Buses to store items in them you have a lot of. Don\u0027t forget to set the priority higher on your Storage Buses than on your Drives.":false},{"47. Setup ME Autocrafting with ME Interfaces and Molecular Assemblers for items your need a lot of.":false},{"48. Setup ME Autoprocessing with ME Interfaces and other machines (like Redstone Furnace, Alloy Smelter, Slice\u0027n\u0027Splice...) for items you need a lot of.":false},{"49. Fully automate ore processing from your Quarry and store the finished products in your ME System.":false},{"50. Setup ME Level Emitters and automatically craft items if you have too few of them, without having to request them.":false},{"51. Make Silk Touch Tinkers Tools, if you haven\u0027t already. You\u0027ll need a Silk Touch Pickaxe for Workshop Bookcases or a Silk Touch Axe for Ancient Bookshelves to craft a Creative Oak Bookcase in the future.":false},{"52. Craft a couple Alchemic Chemistry Sets and use them to make Offensa. Now you can create Powered Spawners for mobdrops your need a lot of.":false},{"53. Make better Blood Magic potions that you can use multiple times before they run out. You can name them with an Anvil so you always know which one\u0027s which.":false},{"54. Kill lots of Scorchers in the Nether to get Purple Blaze, and craft an Infernal Flame.":false},{"55. Using your Infernal Flame, summon the King of Scorchers in the Nether to get Fury Fire, and craft a Golden Fury.":false},{"56. Setup the Ritual of Binding and use your Golden Fury to get a Bound Sword.":false},{"57. Kill mobs with the Bound Sword to get Weak Blood Shards.":false},{"58. Craft Filled Sockets and make all pieces of the Bound Armor. While crafting, consider upgrading it with Sigils to have permanent effects while wearing the armor.":false},{"59. Kill lots of Enthralled Dramcryxes to get Corrupted Shards. They spawn at very low elevations in the overworld. Consider setting up a Powered Spawner for them.":false},{"60. Make Mysterious Clocks, summon and kill the Ancient Entity multiple times, until you have enough Divine Shards for at least 10 Divine Rocks. (Don\u0027t worry, it\u0027s not a difficult boss fight.)":false},{"61. Using the Divine Shards, make a Portal to Eden out of Divine Rocks in a Nether Portal shape. Light it with a Twilight Clock. Bring blocks and your jetpack with you, and collect some Eden Fragments from Eden Ore or Eden Souls.":false},{"62. Advance to a Tier 4 Altar and Setup the Well of Suffering and the Ritual of Regeneration above or below your Altar. Get lots of entities you can damage and activate the Rituals to get infinite blood. (Alternatively use Witches, and then you won\u0027t need the Ritual of Regeneration).":false},{"63. Craft a Petal Apothecary and a Lexica Botania.":false},{"64. Use the Petal Apothecary to make a Pure Daisy.":false},{"65. Convert materials around the Pure Daisy to make Livingrock and Livingwood.":false},{"66. Make a Wand of the Forest.":false},{"67. Craft a Mana Pool and Mana Generating flowers (Daybloom, Nightshade, Endoflame, or Hydroangeas).":false},{"68. Craft a Mana Spreader and more Mana Pools. Connect your flowers to Mana Spreaders.":false},{"69. Craft a Runic Altar.":false},{"70. Craft better Mana Generating Flowers in the Runic Altar. (Endoflame, Gourmaryllis, Munchdew, etc.)":false},{"71. Automatically feed your Mana Generating flowers.":false},{"72. Craft a QED and Ender Flux Crystals to power it.":false},{"73. Craft Infusion Stones to make Magical Crops Essences.":false},{"74. Craft Magical Crops seeds using your Runic Altar.":false},{"75. Setup automated Magical Crops farms using Ender IO Farming Stations.":false},{"76. Use Cropsticks to turn a Magical Crops seed to an AgriCraft seed. Mutate it until its stats reach 10/10/10. (Later down the line, using a Clipper you can get more seeds from existing plants, so you don\u0027t thave  to craft them: see Achievement No. 168.)":false},{"77. Craft AgriCraft Farming Stations to harvest your AgriCraft Magical Crops.":false},{"78. Craft Growth Pulsers to further improve the growth speed of your crops.":false},{"79. Upgrade your existing farms and setup full automation for treefarms using MineFactory Reloaded Planters and Harvesters.":false},{"80. Craft a Magnum Torch to protect your base from mobs.":false},{"81. Craft Eden Blocks and using them, create a Portal to Wildwood. It\u0027s a Nether Portal shape, lit by another Twilight Clock. Mine Wildwood ore or kill mobs to obtain Wildwood Fragments.":false},{"82. Craft an Imaginary Time Block to even further improve the grwoth speed of your crops. Use a Tesseract with a lever to toggle it on and off, because it uses a lot of power.":false},{"83. Craft a Terrestial Agglomeration Plate. Use it to make 1 Terrasteel Ingot.":false},{"84. Make 6 Arcane Pedestals and use 2 RedAurum ingots to make an Arcane Plinth, and summon an Elemental. You\u0027ll need 6 of the same Alchemy materials.":false},{"85. Fight elementals until you obtain some Demon Blood Shards. Note, that it\u0027s not a 100% drop.":false},{"86. Craft 4 Beacons using some Mana Diamond to upgrade your Altar to Tier 5 and use your Demon Blood Shards and a RedAurum ingot to craft an Archmage\u0027s Blood Orb.":false},{"86. Setup the Convocation of the Damned Ritual very far away from your base (maybe another dimension). Let the Demon Village extend and kill the Demons spawning to obtain Life Shards and Soul Shards.":false},{"87. Craft a Portal to the Deep Dark.":false},{"89. Craft an Ender Quarry and some Ender Quarry upgrades and use them to mine materials from the Deep Dark. (You can use a single Tesseract to send power to your Ender Quarry and retrieve items from it.)":false},{"90. Craft another Beacon and use it to enter the Twilight Forest.":false},{"91. Craft a Magic Map to more easily travel around the Twilight Forest.":false},{"92. Find a Naga Courtyard and kill the Naga.":false},{"93. Find a Lich Tower and slay the Lich at the top.":false},{"93. Use the Lich\u0027s Scepter to clear away mosquitos in the swamp.":false},{"94. Find the Maze Map Focus and craft yourself a Blank Maze Map.":false},{"95. Deafeat the Minoshroom Boss to obtain Meef Stroganoff in the labyrinth, and use it so you can enter the Fiery Swamp.":false},{"96. Find and defeat the Hydra in the middle of the Fiery Swamp.":false},{"97. Enter the Dark Forest, break through the leaves, and find the entance of the Goblin Knight Stronghold. Place a Trophy you\u0027ve previously earned on the Trophy Pedestal to remove the shield around the stronghold.":false},{"98. Enter the Stronghold, find and defeat the Knight Phantom. Make sure to grab some Armor Shards, you\u0027ll need them later for Knightmetal Ingots.":false},{"99. Find the Dark Tower in the center of the Dark Forest. Climb up and defeat the Ur-ghast.":false},{"100. Enter the Snowy Forest, find and defeat the Alpha Yeti.":false},{"101. Enter the Glacier biome, find the Icy Tower, and defeat the Snow Queen.":false},{"102. Find the Troll\u0027s Cave in the Twilight Highlands biome, near the Thorns biome. Defeat the Troll and loot the regular Obsidian Box. Obtain Magic Beans and Uberous Soil.":false},{"103. Locate the Giant\u0027s Cloud Cottage above the Twilight Highlands biome. Plant Magic Beans on Uberous Soil to climb up to the Cloud. Defeat the Giant Miner to obtain its Giant Pickaxe.":false},{"104. Descend back down to the Mines, locate the Giant Obsidian Box. Break it with your Giant Pickaxe, and obtain the Lamp of Cinders.":false},{"105. Use the Lamp of Cinders to turn Thorns into Ashes, and progress to the castle.":false},{"106. Obtain Castle Bricks and Castle Roof Tiles for later crafting. You can also VeinMine these blocks.":false},{"107. Find the Center of the Castle and the sign that says \"Final Boss Here, You Win!\". Blame the creator of Twilight Forest for not finishing his mod.":false},{"108. Return home. Setup the Portal to Alfheim. Trade your Lexica Botania and other items to get more resources.":false},{"109. Upgrade your Mana Spreaders to Elven Mana Spreaders.":false},{"110. Craft Gaia Pylons, and fight the Gaia Guardian.":false},{"111. Replace your Elven Mana Spreaders with Gaia Mana Spreaders.":false},{"112. Make a Mana Tablet and Botania gadgets. (I recommend crafting a Globetrotter\u0027s Sash.)":false},{"113. Connect an ME Interface to a Blood Altar and setup automatic crafting with the Blood Altar.":false},{"114. Setup the Ballad of Alchemy Ritual to fully automate Alchemy. Connect an ME Interface to it and setup Alchemy recipes.":false},{"115. Setup ME Interfaces to your Mana Pools. Fully automate regular Mana Infusing, and Alchemy \u0026 Conjuration Catalyst Mana Infusing.":false},{"116. Setup ME Intefaces to your Runic Altars to automatically craft Runes.":false},{"117. Automatically detect when you don\u0027t have enough Mana for crafting. Delay crafting until you automatically gain more Mana.":false},{"118. Setup ME Interfaces to your Alfheim Portal. Fully automate recipes for it.":false},{"119. Make an Apalachia Portal out of Wildwood Blocks, and light it with another Twilight Clock. Kill mobs or mine Apalachia Ore to get Apalachia Fragments.":false},{"120. Craft an Iron Capped Wooden Wand and use it to turn a Bookshelf into a Thaumonomicon.":false},{"121. Craft Thaumcraft Tables and regular Scribing Tools, use your wand to make an Arcane Worktable, and your Scribing Tools to make a Research Table.":false},{"122. Craft a Thaumometer and start finding all the aspects.":false},{"123. Fill up your wand by killing mobs while it\u0027s in your hotbar.":false},{"124. Craft Goggles of Revealing. Seek Nodes around your base.":false},{"125. Craft Thaumaturge Armor to gain a Vis discount when crafting.":false},{"126. Make a Crucible by hitting a Cauldron with your Wand.":false},{"127. Using items from your Crucible, craft an Alchemical Furnace and Arcane Alembics, to improve the creation of essentia.":false},{"128. Upgrade your wand to a Gold Banded Greatwood Wand.":false},{"129. Further improve your Alchemy, by creating an Alchemical Construct.":false},{"130. Craft some Mnemonic Matrix blocks and place them on your Alchemical Construct, so each of them remember two formulas you\u0027ve previously used.":false},{"131. Make Gaia Spirit Ingots and fight the Gaia Guardian II. Obtain a Dice of Faith.":false},{"132. Use your Dice of Faith to create a Runic Matrix. Setup an Infusion Altar, and sorround it with Jars of Essentia.":false},{"133. Make the area around your Infusion Altar symmetrical, and place items (Skulls, Mixed Crystal Clusters, Tallow Candles) around, below, and above it to reduce the chance of your Arcane Infusion failing.":false},{"134. Upgrade your wand to a Thaumium Bossed Silverwood Wand.":false},{"135. Make a Skythern Portal out of Apalachia Blocks, and light it with another Twilight Clock. Kill mobs or mine Skythern Ore to get Skythern Fragments.":false},{"136. Make Void Metal and craft Void Thaumaturge Armor to gain more Vis discount.":false},{"137. Craft a Sanity Checker. Do more research so you get more and more insane.":false},{"138. Once you\u0027re insane enough that an Eldritch Guardian spawns, capture it in a Soul Vial and create a Powered Spawner for it.":false},{"139. Upgrade your wand to a Thaumium Bossed Infernal Wand or use a Silverwood Staff Core that can hold up to 250 of each aspect. (You can find the research under Thaumaturgy on the left coming out of Silverwood Wand Core.)":false},{"140. Setup a Powered Spawner of Wisps for Thaumic Energistics items. You can find Wisps in the Nether and sometimes regular Wisp Spawners under Eldritch Obelisks.":false},{"141. Craft ME Essentia Storage Cells and setup an area close to your Thaumcraft machines to store them in Drives.":false},{"142. Craft Essentia Providers for your Alchemical Constructs, and an Infusion Provider for your Infusion Altar.":false},{"143. Craft an Essentia Terminal and an Arcane Terminal. Connect a Vis Relay Interface and a Vis Relay to your Arcane Terminal.":false},{"144. Capture Nodes in a Jar in the Overworld or in the Deep Dark.":false},{"145. Use Node Stabilizers and Node Transducers to energize your captured Nodes. Connect the Energized Nodes to Vis Relays so they recharge your wand in your Arcane Terminal.":false},{"146. Use 4 Eldritch Eyes on an Eldritch Obelisk to create an Eldritch Portal.":false},{"147. Enter the Maze of the Eldritch Dimension, find the Runed Tablet and use it to open the Ancient Doorway.":false},{"148. Defeat the Champion Eldritch Guardian and obtain the Primordial Pearl.":false},{"149. Use the Primordial Pearl to create an Advanced Alchemical Furnace.":false},{"150. Power your Advanced Alchemical Furnace with Energized Nodes through Vis Relays.":false},{"151. Craft ME Essentia Import Buses for your Advanced Alchemical Furnace and connect it to your Thaumic Energistics system.":false},{"152. Fully automate the creation of Thaumium and Void Metal.":false},{"153. Fully automate Wand Charging.":false},{"154. Craft a Knowledge Inscriber and a Distillation Pattern encoder.":false},{"155. Using Arcane Assemblers, fully automate Arcane crafting, and setup recipes for it.":false},{"156. Setup ME Essentia Level Emitters to indicate if you\u0027re low on one type of Essentia, and trigger autocrafting of that Essentia using your Advanced Alchemical Furnace.":false},{"157. Fully automate Thaumcraft Alchemy recipes, so you can request them from your ME System.":false},{"158. Fully automate Thaumcraft Infusion recipes, so you can request them from your ME System.":false},{"159. Craft Eyes of Ender to find the End Portal. (Yes, you don\u0027t need to do it any earlier than this.)":false},{"160. Defeat the Ender Dragon.":false},{"161. While in the End, mine some Draconium Ore.":false},{"162. Create a Nether Shard and Ender Shard farm, held rarely by Zombie Pigmen in the Nether, and Endermen in the End.":false},{"163. Create Ichor, Ichorcloth and Ichorium.":false},{"164. Craft an Ichorcloth Strapped Silverwood Wand that can hold up to 1000 of each aspect.":false},{"165. Craft Zivicio Armor. Use it when you need creative flight.":false},{"166. Find a way to automate the creation of Ichorium using Thaumic Energistics.":false},{"167. Create higher tier Magical Crops seeds with your Infusion Altar, turn them into AgriCraft seeds, plant them and automatically harvest them.":false},{"168. Craft a Clipper. Now you don\u0027t have to craft each individual Magical Crops Seed again, you can get Clippings from ones that are planted on Crop Sticks.":false},{"169. Make a Mortum Portal out of Skythern Blocks, and light it with another Twilight Clock. Kill mobs or mine Mortum Ore to get Mortum Fragments.":false},{"170. Create automated farms for Belladona, Water Artichoke, Snowbell, Wolfsbane and Garlic.":false},{"171. Make a Powered Spawner for Mandrakes.":false},{"172. Craft a Witches Oven.":false},{"173. Craft Anointing Paste to turn a Cauldron into a Witches Cauldron.":false},{"174. Make Mutandis.":false},{"175. Use Mutandis on tallgrass to obtain Rowan Saplings, Alder Saplings, Hawthorn Saplings, Spanish Moss, Glint Weed, and Ember Moss.":false},{"176. Make automated treefarms for Witchery trees, and plant Spanish Moss, Glint Weed and Ember Moss so it can spread.":false},{"177. Craft a Witchery Altar and sorrund it with a bunch of plants. Variety helps.":false},{"178. Further upgrade the power of your Witchery Altar by putting a Player Head, a Chalice, a Candelabra, a Dragon Egg and an Arthana on top of it.":false},{"179. Make a Distillery and a Kettle.":false},{"180. Upgrade your Chalice into a Filled Chalice.":false},{"181. Find Hobgoblins, leash them and give them a Pickaxe so they\u0027re forced to mine. Collect any Koboldite Dust they find.":false},{"182. Trade Koboldite Dust with Hobgoblins to get Koboldite Nuggets, and eventually Koboldite Ingots.":false},{"183. Replace the Hobgoblins\u0027 Pickaxes with Koboldite Pickaxes to make them mine faster.":false},{"184. Craft or trade Koboldite Nuggets and eventually Koboldite Ingots.":false},{"185. Craft a Pentacle to fully upgrade your Altar.":false},{"186. Craft a Spinning Wheel and make a Witches Hat and Witches Robes to gain a chance to get more brews when using the Kettle.":false},{"187. Brew lots of Brews of Sleeping.":false},{"188. Fall asleep, and enter the Dream World. Bring an Icy Needle with you. While running away from the Nightmare, collect some Disturbed Cotton.":false},{"189. Craft a Dream Weaver of Nightmares and place it close to where you sleep.":false},{"190. Enter the Dream World. If it\u0027s still a nightmare, wake up, and try again, until you have a nice dream. Collect some Wispy Cotton.":false},{"191. Find out that including your clothes, your Tinkers Belt also doesn\u0027t dissapear when entering the Dream World. Use it to your advantage.":false},{"192. Create Brews of Flowing Spirit in the Dream World. After you wake up, create ponds of them around your sleeping area, to make nightmares even less frequent.":false},{"193. Use Soul Vials to capture Spirits that fly around int he Dream World. Once awake, setup a Powered Spawner for them to obtain lots of Subdued Spirit for later crafting.":false},{"194. Create a spawner for Bats to get Wool of the Bat and Hellhound to get Tongue of the Dog.":false},{"195. Create an automatic system that slays mobs with an Arthana to get lots of Spectral Dust.":false},{"196. Craft a Mutating Sprig. Use it to make Wormwood. Make an automatic farm for Wormwood.":false},{"197. Craft a Brazier. Use it to summon a Spectre, a Banshee, and a Poltergeist. Capture them in a Soul Vial. The book \u0027Conjuration \u0026 Fetishes\u0027 explains the process.":false},{"198. Make a toggleable automatic spawner for Spectres, Banshees, and Poltergeists. Setup the Rite of Binding to bind 5 of each of the spectral creatues to a Scarecrow. When activating the Ritual, Death spawns. Defeat Death.":false},{"199. Setup an automated way of summoning Death, and defeat him multiple times. You\u0027ll need some Hands of Death for a future recipe.":false},{"200. Setup the Rite of Summoning to summon a Demon (Circle Magic, Page 50). Trade something for its Heart. Warning: Demons have an explosive nature.":false},{"201. Using Demonic Blood, summon an Imp (Circle Magic, Page 51). Sign a Demonic Contract with it. (Craft a Demonic Contract with your Taglock Kit.)":false},{"202. Give additional Contracts crafted with special Components to your Imp (Blaze Rod + Ember Moss, Lava Bucket, Blaze Rod + Hint of Rebirth, Blaze Rod + Magma Cream, Blaze Powder) for special effects.":false},{"203. Collect the gifts your Imp gives you. Wait until you get a scroll called \u0027Torment\u0027.":false},{"204. Use your Torment scroll in the center of a Stone Brick circle in the overworld to enter the Prison of Torment.":false},{"205. Defeat the Lord of Torment and obtain its Soul for later crafting.":false},{"206. Find a way to automate the creation of items acquired through Circle Magic. Especially the creation of Necromantic Stones.":false},{"207. Summon Shade of Leonard with a Cauldron Ritual that has a Level 12 Effect. (Read the Witches\u0027 Brews book -\u003e Effects -\u003e Level 12. Use Nether Wart, Tear of the Godess, Diamond Vapor, Diamond, Nether Star, and a Witches Hat.)":false},{"208. Defeat Leonard and collect his Urn for later crafting.":false},{"209. Use the Rite of Binding to turn a tamed owl, toad or cat into a familiar.":false},{"210. Once you have a familiar, Coven Witches will talk to you. Convince 6 of them to join your coven.":false},{"211. Craft a Seer Stone (Circle Magic, Page 64) to be able to call your coven whenever you need to.":false},{"212. Use the Curse of the Wolf (Circle Magic, Page 81) on yourself to become a Werewolf.":false},{"213. Craft a Wolf Altar to be able to level up your Werewolf level.":false},{"214. Advance to a Lv2 Werewolf, kill some sheep, and obtain Lambchop for later crafting.":false},{"215. Use the Rite of Remove Curse (Circle Magic, Page 87), to turn back into a Human from Werewolf and setup ME Autocrafting for duplicating Lambcrystals.":false},{"216. Make an automatic Spanish Moss farm.":false},{"217. Connect Witchery machines with Applied Energistics 2 cables and setup multiple Witchery Altars in order to automatically craft Death Protection Poppets.":false},{"218. Build a Portal to the Dungeon of Arcana.":false},{"219. Kill Dungeon Constructors in the Dungeon of Arcana to get keys for opening doors in the dungeon. Mine Arcanium Ore from behind the doors.":false},{"220. Obtain Collectors from mobs in the dungeon. Obtain Charged Collectors by trading 16 Collectors to Lord Vatticus.":false},{"221. Find the Arcana Extractor and make Arcanium using Arcanium Ore, and Charged Collectors.":false},{"222. Trade Arcanium with Datticon to get 3 Elevantiums and 3 Accelerons.":false},{"223. Craft a Nightmare Bed and use it to enter Vethea.":false},{"224. Similarly to the Dream World, Vethea also allows you to bring a Tinkers Belt to your dreams. Use it to your advantage.":false},{"225. Collect Fire Crystal and Firelight Blocks in Vethea.":false},{"226. Advance to the top layer of Vethea and obtain Shiny Pearls. Consider setting up a Powered Spawner for any mob that drops it.":false},{"227. Start the autocrafting of Extra Cells 16384k Storage Components, because you\u0027ll need them for your second Createive Item, the Storage Drawers Creative Storage Upgrade, and those Storage Components do take a while to craft.":false},{"228. Craft a Draconic Core.":false},{"229. Build an automatic Wither killer. Use a Draconic Evolution Mob Grinder.":false},{"230. Craft a Dire Crafting Table, if you haven\u0027t already.":false},{"231. Craft an Angel Ring, if you haven\u0027t already.":false},{"232. Craft a Wyvern Core.":false},{"234. Explore the End and search for Ender Comets that contain a lot of Draconium Ore.":false},{"235. Upgrade you Blood Altar to Tier 6.":false},{"236. Make a full set of Wyvern Armor.":false},{"237. Make a full set of Wyvern Tools.":false},{"238. Make an Upgrade Modifier and upgrade your Wyvern Armor and Tools.":false},{"239. Build a Draconic Energy Core to store your RF Power.":false},{"240. Automatically kill mobs with a Wyvern Sword to obtain Mob Souls. Alternatively, enchant your sword with Reaper, get the enchantment off the sword with a Disenchanting method, and put it on Spikes.":false},{"241. Craft a Resurrection Stone and resurrect the Ender Dragon.":false},{"242. Defeat the Ender Dragon multiple times and obtain its Heart.":false},{"243. Convert 4 Charged Draconium Blocks, 16 Draconic Cores and a Dragon Heart into 4 Awakened Draconium blocks with an explosion.":false},{"244. Craft a full set of Draconic Armor.":false},{"245. Craft a full set of Draconic Tools.":false},{"246. Craft a Draconic Staff of Power.":false},{"247. Upgrade your Draconic Armor and Tools in the Upgrade Modifier.":false},{"248. Place Enchanted Books in the Draconic Armor\u0027s and Tools\u0027 inventory to enchant them.":false},{"249 Craft Draconic Flux Capacitors.":false},{"250. Find the island of the Chaos Guardian and defeat it.":false},{"251. Find a way to automatically resummon and kill the Ender Dragon to collect its Heart, and fully automate the creation of Awakened Draconium with that. (Use tons of Draconic Bows and Autonomous Activators.)":false},{"252. Craft a Dimlet Researcher and research Dimlets you get from automatically spawning Enderman.":false},{"253. Craft a Dimension Enscriber and a Dimension Builder.":false},{"254. Craft a Matter Transmitter, and Matter Receiver, a Dialing Device, and a Charged Porter. Set the Charged Porter so it returns you to your Matter Receiver.":false},{"255. Build a random dimension, explore it and find dimlets.":false},{"256. Build a custom dimension out of blocks of your choice.":false},{"257. Find dimensional shards in a dimension.":false},{"258. Upgrade your Charged Porter to an Advanced Charged Porter.":false},{"259. Make an Enhanced Charm of Dislocation.":false},{"260. Craft a Machine Infuser and a Dimlet Workbench, and fully infuse your Dimlet Workbench.":false},{"261. Break down dimlets in a Dimlet Workbench and craft a new one of your choice.":false},{"262. Build a dimension full of Dimensional Shards.":false},{"263. Build a dimension full of Life Essence. Use Tesseracts to import it into your Blood Altar, and use Runes of Dislocation to make the process faster.":false},{"264. Build a dimension full of Ender Dragons.":false},{"265. Craft Creative Oak Bookcases.":false},{"266. Craft a Creative Storage Upgrade.":false},{"267. Use the Alchemic Chemistry Set to duplicate Netherite and Bloodgem.":false},{"268. Craft a Creative Cache.":false},{"269. Automatically grow and harvest Capacitor Seeds.":false},{"270. Setup multiple huge Minicio fields and fully speed up the harvesting of them to autocraft Zivi-Essences.":false},{"271. Craft a Creative Flux Pack.":false},{"272. Craft a Creative Jetpack.":false},{"273. Craft a Creative Flux Capacitor.":false},{"274. Craft a Creative Energy Cell from Applied Energistics 2.":false},{"275. Craft a Creative Energy Cell from Thermal Expansion.":false},{"276. Craft a Creative Capacitor Bank.":false},{"277. Craft a Creative Activation Crystal.":false},{"278. Craft an Orb of Testing.":false},{"279. Craft some Soul Fragments.":false},{"280. Craft a Pile of Neutrons.":false},{"281. Craft a Neutronium Compressor to make Singularities.":false},{"282. Craft a Dire Autocrafting Table.":false},{"283. Setup automation using the Dire Autocrafting Table.":false},{"284. Craft a Creative Sacrificial Knife.":false},{"285. Craft an Infinity Egg.":false},{"286. Craft an Infinity Catalyst.":false},{"287. Craft a Neutron Collector to enhance your Neutron production.":false},{"288. Use a Slaughterhouse to create liquid Pink Slime and place that in the world. Use a Slime Embiggening Syringe to enlarge it. Kill the larger slime to create more small ones and repeat the process.":false},{"289. Craft a Creative Portable Tank.":false},{"290. Craft a Creative Dimension Builder.":false},{"291. Setup the Convocation of the Damned Ritual multiple times and harvest the Demon Portal.":false},{"292. Craft an Infinity Ingot.":false},{"293. Craft the Blood Orb of Armok.":false},{"294. Automate the Binding Ritual to create Plasticrystals.":false},{"295. Automate the crafting of Air, Earth, Fire \u0026 Water Crystals using Dire Autocrafting Tables.":false},{"296. Craft the Everlasting Guilty Mana Pool.":false},{"297. Craft the Creative Strongbox.":false},{"":false},{"":false},{"298. Make Infinite Infinity Ingots.":false},{"299. [Bonus] Use the Creative Strongbox to craft even more Creative Items.":false},{"300. [Bonus] Using Infinity Ingots, craft a full set of Infinity Armor, Tools \u0026 Weapons, and a Crystal Studded Cosmic Netronium Wand.":false},{"DONE! 100% COMPLETE!":false}]}